[
    {
        "name": "Metaphysics",
        "description": "Metaphysics is the branch of philosophy concerned with the nature of reality and existence.",
        "links": [
            "Epistemology",
            "Ethics",
            "Logic",
            "Dualism",
            "Idealism",
            "Nihilism",
            "Solipsism"
        ]
    },
    {
        "name": "Epistemology",
        "description": "Epistemology is the branch of philosophy concerned with the nature, scope, and limits of knowledge.",
        "links": [
            "Logic",
            "Pragmatism",
            "Rationalism",
            "Empiricism"
        ]
    },
        {
        "name": "Immanuel Kant",
        "description": "Immanuel Kant is a famous philosopher.",
        "links": [
        ]
    },
    {
        "name": "Ethics",
        "description": "Ethics is the branch of philosophy concerned with moral principles and values.",
        "links": [
            "Logic",
            "Metaphysics",
            "Aesthetics",
            "Utilitarianism",
            "Deontology",
            "Hedonism",
            "Nihilism"
        ]
    },
    {
        "name": "Logic",
        "description": "Logic is the branch of philosophy concerned with reasoning and inference.",
        "links": [
            "Epistemology"
        ]
    },
    {
        "name": "Aesthetics",
        "description": "Aesthetics is the branch of philosophy concerned with the nature of beauty and artistic expression.",
        "links": [
            "Ethics"
        ]
    },
    {
        "name": "Ontology",
        "description": "Ontology is the branch of philosophy concerned with the study of being and existence.",
        "links": [
            "Metaphysics"
        ]
    },
    {
        "name": "Existentialism",
        "description": "Existentialism is a philosophical movement concerned with individual existence, freedom, and choice.",
        "links": [
            "Realism",
            "Absurdism"
        ]
    },
    {
        "name": "Idealism",
        "description": "Idealism is the philosophical belief that reality is fundamentally mental or spiritual.",
        "links": [
            "Metaphysics"
        ]
    },
    {
        "name": "Realism",
        "description": "Realism is the philosophical belief that reality exists independent of human perception.",
        "links": [
            "Dualism",
            "Existentialism"
        ]
    },
    {
        "name": "Pragmatism",
        "description": "Pragmatism is a philosophical approach that evaluates the truth of beliefs based on their practical consequences.",
        "links": [
            "Epistemology"
        ]
    },
    {
        "name": "Utilitarianism",
        "description": "Utilitarianism is a moral theory that suggests the best action is the one that maximizes utility or happiness for the greatest number of people.",
        "links": [
            "Ethics"
        ]
    },
    {
        "name": "Deontology",
        "description": "Deontology is a moral theory that judges the morality of actions based on their adherence to rules or duties.",
        "links": [
            "Ethics"
        ]
    },
    {
        "name": "Hedonism",
        "description": "Hedonism is the philosophical belief that pleasure and happiness are the highest good.",
        "links": [
            "Ethics"
        ]
    },
    {
        "name": "Nihilism",
        "description": "Nihilism is the philosophical belief that life is without objective meaning, purpose, or intrinsic value.",
        "links": [
            "Metaphysics",
            "Ethics"
        ]
    },
    {
        "name": "Absurdism",
        "description": "Absurdism is a philosophical belief that life is inherently absurd and without objective meaning, yet individuals can create meaning through their actions.",
        "links": [
            "Existentialism"
        ]
    },
    {
        "name": "Empiricism",
        "description": "Empiricism is the philosophical belief that knowledge comes primarily from sensory experience.",
        "links": [
            "Epistemology"
        ]
    },
    {
        "name": "Rationalism",
        "description": "Rationalism is the philosophical belief that knowledge is primarily or solely derived from reason or intellect.",
        "links": [
            "Epistemology"
        ]
    },
    {
        "name": "Phenomenology",
        "description": "Phenomenology is the philosophical study of the structure of consciousness and subjective experience.",
        "links": [
            "Rationalism"
        ]
    },
    {
        "name": "Solipsism",
        "description": "Solipsism is the philosophical belief that only one's mind is sure to exist, and everything else, including the external world and other minds, may not exist.",
        "links": [
            "Metaphysics"
        ]
    },
    {
        "name": "Dualism",
        "description": "Dualism is the philosophical belief that reality consists of two fundamentally different substances, often mind and matter.",
        "links": [
            "Metaphysics"
        ]
    },
    {
        "name": "Determinism",
        "description": "Determinism is the philosophical theory that all events, including moral choices, are completely determined by previously existing causes.",
        "links": [
            "Free Will",
            "Metaphysics",
            "Ethics"
        ]
    },
    {
        "name": "Free Will",
        "description": "Free Will is the concept that individuals have the power to make choices that are not predetermined by past events or natural laws.",
        "links": [
            "Determinism",
            "Ethics",
            "Metaphysics"
        ]
    },
    {
        "name": "Skepticism",
        "description": "Skepticism is the philosophical attitude of doubting the veracity of knowledge claims in many areas.",
        "links": [
            "Epistemology",
            "Rationalism",
            "Empiricism"
        ]
    },
    {
        "name": "Stoicism",
        "description": "Stoicism is a philosophy of personal ethics informed by its system of logic and its views on the natural world.",
        "links": [
            "Ethics",
            "Epistemology",
            "Logic"
        ]
    },
    {
        "name": "Virtue Ethics",
        "description": "Virtue Ethics is a moral philosophy that emphasizes virtues, moral character, and the morality of individuals rather than rules or consequences.",
        "links": [
            "Ethics",
            "Deontology",
            "Utilitarianism"
        ]
    },
    {
        "name": "Phenomenalism",
        "description": "Phenomenalism is the view that physical objects cannot justifiably be said to exist in themselves, but only as perceptual phenomena.",
        "links": [
            "Epistemology",
            "Metaphysics",
            "Phenomenology"
        ]
    },
    {
        "name": "Post-Structuralism",
        "description": "Post-Structuralism is a late 20th-century movement in philosophy and literary theory, which is critical of structuralism.",
        "links": [
            "Structuralism",
            "Deconstruction"
        ]
    },
    {
        "name": "Deconstruction",
        "description": "Deconstruction is a method of critical analysis of philosophical and literary language which emphasizes the internal workings of language and conceptual systems.",
        "links": [
            "Post-Structuralism",
            "Phenomenology"
        ]
    },
    {
        "name": "Structuralism",
        "description": "Structuralism is the methodology that elements of human culture must be understood by way of their relationship to a broader, overarching system or structure.",
        "links": [
            "Post-Structuralism",
            "Deconstruction",
            "Semiotics"
        ]
    },
    {
        "name": "Semiotics",
        "description": "Semiotics is the study of signs and symbols and their use or interpretation.",
        "links": [
            "Structuralism",
            "Post-Structuralism"
        ]
    },
    {
        "name": "Aristotle",
        "description": "Aristotle was an ancient Greek philosopher and scientist who made significant contributions to numerous fields of study.",
        "links": [
            "Metaphysics",
            "Ethics",
            "Logic"
        ]
    },
    {
        "name": "Scholasticism",
        "description": "Scholasticism is a method of critical thought which dominated teaching by the academics of medieval universities in Europe.",
        "links": [
            "Metaphysics",
            "Theology",
            "Logic"
        ]
    },
    {
        "name": "Theology",
        "description": "Theology is the critical study of the nature of the divine, and more broadly, of religious belief.",
        "links": [
            "Scholasticism",
            "Ethics",
            "Philosophy of Religion"
        ]
    },
    {
        "name": "Philosophy of Religion",
        "description": "Philosophy of Religion is the philosophical examination of the central themes and concepts involved in religious traditions.",
        "links": [
            "Theology",
            "Ethics",
            "Metaphysics"
        ]
    }
]
